; domain
; (define (domain taxi)
;   (:requirements :strips :typing)

;   (:types taxi passenger location)

;   (:predicates
;     (at ?t ?l)
;     (at-passenger ?p ?l)
;     (in-taxi ?p)
;     (connected ?l1 ?l2)
;     (served ?p)
;   )

;   ;; Move between adjacent locations
;   (:action move
;     :parameters (?t ?from ?to)
;     :precondition (and (at ?t ?from) (connected ?from ?to))
;     :effect (and (not (at ?t ?from)) (at ?t ?to))
;   )

;   ;; Pick up passenger
;   (:action pickup
;     :parameters (?t ?p ?l)
;     :precondition (and (at ?t ?l) (at-passenger ?p ?l))
;     :effect (and (not (at-passenger ?p ?l)) (in-taxi ?p))
;   )

;   ;; Drop off passenger
;   (:action dropoff
;     :parameters (?t ?p ?l)
;     :precondition (and (at ?t ?l) (in-taxi ?p))
;     :effect (and (not (in-taxi ?p)) (at-passenger ?p ?l) (served ?p))
;   )
; )


(define (domain taxi)
  (:requirements :strips :typing)

  (:types 
      taxi 
      passenger 
      location
  )

  (:predicates
    (at ?t - taxi ?l - location)
    (at-passenger ?p - passenger ?l - location)
    (in-taxi ?p - passenger)
    (connected ?l1 - location ?l2 - location)
    (served ?p - passenger)
  )

  ;; Move between adjacent locations
  (:action move
    :parameters (?t - taxi ?from - location ?to - location)
    :precondition (and 
        (at ?t ?from)
        (connected ?from ?to)
    )
    :effect (and 
        (not (at ?t ?from)) 
        (at ?t ?to)
    )
  )

  ;; Pick up passenger
  (:action pickup
    :parameters (?t - taxi ?p - passenger ?l - location)
    :precondition (and 
        (at ?t ?l)
        (at-passenger ?p ?l)
    )
    :effect (and 
        (not (at-passenger ?p ?l)) 
        (in-taxi ?p)
    )
  )

  ;; Drop off passenger
  (:action dropoff
    :parameters (?t - taxi ?p - passenger ?l - location)
    :precondition (and 
        (at ?t ?l)
        (in-taxi ?p)
    )
    :effect (and
        (not (in-taxi ?p))
        (at-passenger ?p ?l)
        (served ?p)
    )
  )
)

; problem
; (define (problem taxi-problem)
;   (:domain taxi)

;   (:objects
;     taxi1
;     passenger1
;     ;; define all grid cells you reference in connected()
;     loc-0-0 loc-0-1 loc-0-2 loc-0-3 loc-0-4
;     loc-1-0 loc-1-1 loc-1-2 loc-1-3 loc-1-4
;     loc-2-0 loc-2-1 loc-2-2 loc-2-3 loc-2-4
;     loc-3-0 loc-3-1 loc-3-2 loc-3-3 loc-3-4
;     loc-4-0 loc-4-1 loc-4-2 loc-4-3 loc-4-4
;   )

;   (:init
;     ;; Taxi starts at (3,4)
;     (at taxi1 loc-3-4)
;     ;; Passenger waiting at (0,4)
;     (at-passenger passenger1 loc-0-4)

; (connected loc-0-1 loc-0-0)
;   (connected loc-0-2 loc-0-3)
;   (connected loc-0-4 loc-0-3)
;   (connected loc-1-0 loc-0-0)
;   (connected loc-1-1 loc-0-1)
;   (connected loc-1-2 loc-0-2)
;   (connected loc-1-3 loc-0-3)
;   (connected loc-1-4 loc-0-4)

;   ;; Row 1
;   (connected loc-1-1 loc-1-0)
;   (connected loc-1-2 loc-1-3)
;   (connected loc-1-4 loc-1-3)
;   (connected loc-2-0 loc-1-0)
;   (connected loc-2-1 loc-1-1)
;   (connected loc-2-2 loc-1-2)
;   (connected loc-2-3 loc-1-3)
;   (connected loc-2-4 loc-1-4)

;   ;; Row 2
;   (connected loc-2-1 loc-2-0)
;   (connected loc-2-2 loc-2-1)
;   (connected loc-2-3 loc-2-2)
;   (connected loc-2-4 loc-2-3)
;   (connected loc-3-0 loc-2-0)
;   (connected loc-3-1 loc-2-1)
;   (connected loc-3-2 loc-2-2)
;   (connected loc-3-3 loc-2-3)
;   (connected loc-3-4 loc-2-4)

;   ;; Row 3
;   (connected loc-3-1 loc-3-0)
;   (connected loc-3-3 loc-3-2)
;   (connected loc-3-4 loc-3-3)
;   (connected loc-4-0 loc-3-0)
;   (connected loc-4-1 loc-3-1)
;   (connected loc-4-2 loc-3-2)
;   (connected loc-4-3 loc-3-3)
;   (connected loc-4-4 loc-3-4)

;   ;; Row 4
;   (connected loc-4-1 loc-4-0)
;   (connected loc-4-2 loc-4-1)
;   (connected loc-4-3 loc-4-2)
;   (connected loc-4-4 loc-4-3)

;   )

;   (:goal (and (served passenger1)))
; )
(define (problem taxi-problem)
  (:domain taxi)

  (:objects
    taxi1 - taxi
    passenger1 - passenger

    loc-0-0 loc-0-1 loc-0-2 loc-0-3 loc-0-4
    loc-1-0 loc-1-1 loc-1-2 loc-1-3 loc-1-4
    loc-2-0 loc-2-1 loc-2-2 loc-2-3 loc-2-4
    loc-3-0 loc-3-1 loc-3-2 loc-3-3 loc-3-4
    loc-4-0 loc-4-1 loc-4-2 loc-4-3 loc-4-4
      - location
  )

  (:init
    (at taxi1 loc-3-4)
    (at-passenger passenger1 loc-0-4)

    ;; FULL CONNECTIVITY (5x5 grid with Manhattan adjacency)
    ;; Row 0
    (connected loc-0-0 loc-0-1)
    (connected loc-0-1 loc-0-0)
    (connected loc-0-1 loc-0-2)
    (connected loc-0-2 loc-0-1)
    (connected loc-0-2 loc-0-3)
    (connected loc-0-3 loc-0-2)
    (connected loc-0-3 loc-0-4)
    (connected loc-0-4 loc-0-3)

    ;; Vertical edges from row 0 to row 1
    (connected loc-0-0 loc-1-0)
    (connected loc-1-0 loc-0-0)
    (connected loc-0-1 loc-1-1)
    (connected loc-1-1 loc-0-1)
    (connected loc-0-2 loc-1-2)
    (connected loc-1-2 loc-0-2)
    (connected loc-0-3 loc-1-3)
    (connected loc-1-3 loc-0-3)
    (connected loc-0-4 loc-1-4)
    (connected loc-1-4 loc-0-4)

    ;; Row 1
    (connected loc-1-0 loc-1-1)
    (connected loc-1-1 loc-1-0)
    (connected loc-1-1 loc-1-2)
    (connected loc-1-2 loc-1-1)
    (connected loc-1-2 loc-1-3)
    (connected loc-1-3 loc-1-2)
    (connected loc-1-3 loc-1-4)
    (connected loc-1-4 loc-1-3)

    ;; Vertical edges row 1 ↔ row 2
    (connected loc-1-0 loc-2-0)
    (connected loc-2-0 loc-1-0)
    (connected loc-1-1 loc-2-1)
    (connected loc-2-1 loc-1-1)
    (connected loc-1-2 loc-2-2)
    (connected loc-2-2 loc-1-2)
    (connected loc-1-3 loc-2-3)
    (connected loc-2-3 loc-1-3)
    (connected loc-1-4 loc-2-4)
    (connected loc-2-4 loc-1-4)

    ;; Row 2
    (connected loc-2-0 loc-2-1)
    (connected loc-2-1 loc-2-0)
    (connected loc-2-1 loc-2-2)
    (connected loc-2-2 loc-2-1)
    (connected loc-2-2 loc-2-3)
    (connected loc-2-3 loc-2-2)
    (connected loc-2-3 loc-2-4)
    (connected loc-2-4 loc-2-3)

    ;; Row 2 ↔ Row 3
    (connected loc-2-0 loc-3-0)
    (connected loc-3-0 loc-2-0)
    (connected loc-2-1 loc-3-1)
    (connected loc-3-1 loc-2-1)
    (connected loc-2-2 loc-3-2)
    (connected loc-3-2 loc-2-2)
    (connected loc-2-3 loc-3-3)
    (connected loc-3-3 loc-2-3)
    (connected loc-2-4 loc-3-4)
    (connected loc-3-4 loc-2-4)

    ;; Row 3
    (connected loc-3-0 loc-3-1)
    (connected loc-3-1 loc-3-0)
    (connected loc-3-1 loc-3-2)
    (connected loc-3-2 loc-3-1)
    (connected loc-3-2 loc-3-3)
    (connected loc-3-3 loc-3-2)
    (connected loc-3-3 loc-3-4)
    (connected loc-3-4 loc-3-3)

    ;; Row 3 ↔ Row 4
    (connected loc-3-0 loc-4-0)
    (connected loc-4-0 loc-3-0)
    (connected loc-3-1 loc-4-1)
    (connected loc-4-1 loc-3-1)
    (connected loc-3-2 loc-4-2)
    (connected loc-4-2 loc-3-2)
    (connected loc-3-3 loc-4-3)
    (connected loc-4-3 loc-3-3)
    (connected loc-3-4 loc-4-4)
    (connected loc-4-4 loc-3-4)
  )

  (:goal (served passenger1))
)

; plan
1. (move taxi1 loc-3-4 loc-2-4)
   deleted: (at taxi1 loc-3-4)
   added: (at taxi1 loc-2-4)
   goals met: 0 of 1
2. (move taxi1 loc-2-4 loc-1-4)
   deleted: (at taxi1 loc-2-4)
   added: (at taxi1 loc-1-4)
   goals met: 0 of 1
3. (move taxi1 loc-1-4 loc-0-4)
   deleted: (at taxi1 loc-1-4)
   added: (at taxi1 loc-0-4)
   goals met: 0 of 1
4. (pickup taxi1 passenger1 loc-0-4)
   deleted: (at-passenger passenger1 loc-0-4)
   added: (in-taxi passenger1)
   goals met: 0 of 1
5. (dropoff taxi1 passenger1 loc-0-4)
   deleted: (in-taxi passenger1)
   added: (at-passenger passenger1 loc-0-4) (served passenger1)
   goals met: 1 of 1
